Autodesk.Revit.DB.Revision.ReorderRevisionSequence(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Reorders the sequence of Revisions in the project.
Remarks:
This method allows the caller to change the sequence of the Revisions within the project by specifying the
new sequence.  The specified sequence must include every Revision in the project exactly once.
Note that changing the sequence of Revisions can change the SequenceNumber and RevisionNumber
of Revisions that have already been issued.
document:
The document in which the Revision sequence should be reordered.
newSequence:
The new sequence of Revisions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSequence does not contain every Revision exactly once.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Revision.NumberType
Indicates what number type the Revision Number for this Revision should use.
Remarks:
This property defines how the RevisionNumber will be assigned and displayed.
RevisionNumberType.Numeric:  Numeric Revisions will use consecutive positive integers starting with 1.RevisionNumberType.Alphabetic:  Alphabetic Revisions will use consecutive strings generated from the RevisionAlphabet
specified in the project's RevisionSettings.RevisionNumberType.None:  The Revision Number will always be the empty string.
Revision numbers will always be assigned in revision sequence order.
If the project contains a mix of Revision objects with different NumberTypes then the Revisions using a
particular NumberType will always be assigned consecutive revision numbers.  In other words, the first three
numeric Revisions in the project will always be assigned revision numbers 1, 2, and 3, even if the revision
sequence includes intervening Revisions that are alphabetic or not numbered.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on Revisions that have already been issued.
Since:
2015